KuroMaple/bump-htn-2026/firmware/sdkconfig.defaults
# Target the badge MCU. Hardware-specific peripherals are intentionally not
# enabled until their pins are verified from the PCB.
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=0
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_NVS_ENCRYPTION=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
